HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/vortexShed/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }

    "outlet|top|bottom"
    {
        type            totalPressure;
        rho             none;
        psi             none;
        p0              $internalField;
        gamma           1;
        value           $internalField;
    }
}


// ************************************************************************* //
