HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/vortexShed/0.orig/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.51e-05;

boundaryField
{
    cylinder
    {
        type            zeroGradient;
        value           $internalField;
    }

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "outlet|top|bottom"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
}


// ************************************************************************* //
