HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/vortexShed/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1.0e-05;

boundaryField
{
    cylinder
    {
        type            nutUSpaldingWallFunction;
        value           $internalField;
    }

    inlet
    {
        type            calculated;
        value           $internalField;
    }

    "outlet|top|bottom"
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
