HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/vortexShed/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
//        solver          PCG;
//        preconditioner  DIC;
        tolerance       1e-20;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        tolerance       1e-6;
        relTol          0;
    };

    "(U|nuTilda)"
    {
//        solver           PBiCGStab;
//        preconditioner   DILU;
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       0;
        relTol          0.1;
    }

    "(U|nuTilda)Final"
    {
        $U;
        tolerance        1e-6;
        relTol           0;
    }
}

PIMPLE
{
    nOuterCorrectors 5;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    transonic       no;
    consistent	    no;
}

relaxationFactors
{
    nuTilda         0.95;
    U               0.95;
    p               0.95;
    ".*Final"        1.0;
}


// ************************************************************************* //
