HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/vortexShed/system/noiseDict-point
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      noiseDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

noiseModel      pointNoise;

pointNoiseCoeffs
{
    windowModel     Hanning;

    HanningCoeffs
    {
        // Window overlap percentage
        overlapPercent  50;
        symmetric       yes;
        extended        yes;

        // Optional number of windows, default = all available
        //nWindow         5;
    }

    files
    (
        "postProcessing/probes/0/p"
        "postProcessing/probes/0.1/Curle"
    );

    nHeaderLine     6;
    refColumn       0;
    componentColumns (1);
    mergeSeparators yes;
    separator       " ";

    // Number of samples in sampling window
    // Must be a power of 2, default = 2^16 (=65536)
    N               4096;

    rhoRef          1.205;
}


// ************************************************************************* //
