HELYXcore-4.4.0/examples/legacy/incompressible/pimpleFoam/LES/vortexShed/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

rm -f system/blockMeshDict
m4 system/blockMeshDict.m4 > system/blockMeshDict

runApplication blockMesh

restore0Dir

runApplication decomposePar

runParallel $(getApplication)
